HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEbu_regdef.h
/**
 * \file IfxEbu_regdef.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC29X_UM_V1.1.R1
 * Specification: tc29x_um_v1.1p4_SFR_OPEN_MARKET.xml (Revision: UM_V1.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Ebu Ebu
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Ebu_Bitfields Bitfields
 * \ingroup IfxLld_Ebu
 * 
 * \defgroup IfxLld_Ebu_union Union
 * \ingroup IfxLld_Ebu
 * 
 * \defgroup IfxLld_Ebu_struct Struct
 * \ingroup IfxLld_Ebu
 * 
 */
#ifndef IFXEBU_REGDEF_H
#define IFXEBU_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Ebu_Bitfields
 * \{  */

/** \\brief  EBU Access Enable Register 0 */
typedef struct _Ifx_EBU_ACCEN0_Bits
{
    Ifx_Strict_32Bit EN0:1;                 /**< \brief [0:0] Access Enable for Master TAG ID 0 (rw) */
    Ifx_Strict_32Bit EN1:1;                 /**< \brief [1:1] Access Enable for Master TAG ID 1 (rw) */
    Ifx_Strict_32Bit EN2:1;                 /**< \brief [2:2] Access Enable for Master TAG ID 2 (rw) */
    Ifx_Strict_32Bit EN3:1;                 /**< \brief [3:3] Access Enable for Master TAG ID 3 (rw) */
    Ifx_Strict_32Bit EN4:1;                 /**< \brief [4:4] Access Enable for Master TAG ID 4 (rw) */
    Ifx_Strict_32Bit EN5:1;                 /**< \brief [5:5] Access Enable for Master TAG ID 5 (rw) */
    Ifx_Strict_32Bit EN6:1;                 /**< \brief [6:6] Access Enable for Master TAG ID 6 (rw) */
    Ifx_Strict_32Bit EN7:1;                 /**< \brief [7:7] Access Enable for Master TAG ID 7 (rw) */
    Ifx_Strict_32Bit EN8:1;                 /**< \brief [8:8] Access Enable for Master TAG ID 8 (rw) */
    Ifx_Strict_32Bit EN9:1;                 /**< \brief [9:9] Access Enable for Master TAG ID 9 (rw) */
    Ifx_Strict_32Bit EN10:1;                /**< \brief [10:10] Access Enable for Master TAG ID 10 (rw) */
    Ifx_Strict_32Bit EN11:1;                /**< \brief [11:11] Access Enable for Master TAG ID 11 (rw) */
    Ifx_Strict_32Bit EN12:1;                /**< \brief [12:12] Access Enable for Master TAG ID 12 (rw) */
    Ifx_Strict_32Bit EN13:1;                /**< \brief [13:13] Access Enable for Master TAG ID 13 (rw) */
    Ifx_Strict_32Bit EN14:1;                /**< \brief [14:14] Access Enable for Master TAG ID 14 (rw) */
    Ifx_Strict_32Bit EN15:1;                /**< \brief [15:15] Access Enable for Master TAG ID 15 (rw) */
    Ifx_Strict_32Bit EN16:1;                /**< \brief [16:16] Access Enable for Master TAG ID 16 (rw) */
    Ifx_Strict_32Bit EN17:1;                /**< \brief [17:17] Access Enable for Master TAG ID 17 (rw) */
    Ifx_Strict_32Bit EN18:1;                /**< \brief [18:18] Access Enable for Master TAG ID 18 (rw) */
    Ifx_Strict_32Bit EN19:1;                /**< \brief [19:19] Access Enable for Master TAG ID 19 (rw) */
    Ifx_Strict_32Bit EN20:1;                /**< \brief [20:20] Access Enable for Master TAG ID 20 (rw) */
    Ifx_Strict_32Bit EN21:1;                /**< \brief [21:21] Access Enable for Master TAG ID 21 (rw) */
    Ifx_Strict_32Bit EN22:1;                /**< \brief [22:22] Access Enable for Master TAG ID 22 (rw) */
    Ifx_Strict_32Bit EN23:1;                /**< \brief [23:23] Access Enable for Master TAG ID 23 (rw) */
    Ifx_Strict_32Bit EN24:1;                /**< \brief [24:24] Access Enable for Master TAG ID 24 (rw) */
    Ifx_Strict_32Bit EN25:1;                /**< \brief [25:25] Access Enable for Master TAG ID 25 (rw) */
    Ifx_Strict_32Bit EN26:1;                /**< \brief [26:26] Access Enable for Master TAG ID 26 (rw) */
    Ifx_Strict_32Bit EN27:1;                /**< \brief [27:27] Access Enable for Master TAG ID 27 (rw) */
    Ifx_Strict_32Bit EN28:1;                /**< \brief [28:28] Access Enable for Master TAG ID 28 (rw) */
    Ifx_Strict_32Bit EN29:1;                /**< \brief [29:29] Access Enable for Master TAG ID 29 (rw) */
    Ifx_Strict_32Bit EN30:1;                /**< \brief [30:30] Access Enable for Master TAG ID 30 (rw) */
    Ifx_Strict_32Bit EN31:1;                /**< \brief [31:31] Access Enable for Master TAG ID 31 (rw) */
} Ifx_EBU_ACCEN0_Bits;

/** \\brief  EBU Access Enable Register 1 */
typedef struct _Ifx_EBU_ACCEN1_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_EBU_ACCEN1_Bits;

/** \\brief  EBU Address Select Register */
typedef struct _Ifx_EBU_ADDRSEL_Bits
{
    Ifx_Strict_32Bit REGENAB:1;             /**< \brief [0:0] Memory Region Enable (rw) */
    Ifx_Strict_32Bit ALTENAB:1;             /**< \brief [1:1] Alternate Segment Comparison Enable (rw) */
    Ifx_Strict_32Bit WPROT:1;               /**< \brief [2:2] Memory Region Write Protect (rw) */
    Ifx_Strict_32Bit GLOBALCS:1;            /**< \brief [3:3] Combined Chip Select Control (rw) */
    Ifx_Strict_32Bit MASK:4;                /**< \brief [7:4] Memory Region Address Mask (rw) */
    Ifx_Strict_32Bit ALTSEG:4;              /**< \brief [11:8] Memory Region Alternate Segment (rw) */
    Ifx_Strict_32Bit BASE:20;               /**< \brief [31:12] Memory Region Base Address (rw) */
} Ifx_EBU_ADDRSEL_Bits;

/** \\brief  EBU Bus Read Access Parameter Register */
typedef struct _Ifx_EBU_BUSRAP_Bits
{
    Ifx_Strict_32Bit RDDTACS:4;             /**< \brief [3:0] Recovery Cycles between Different Regions (rw) */
    Ifx_Strict_32Bit RDRECOVC:3;            /**< \brief [6:4] Recovery Cycles after Read Accesses (rw) */
    Ifx_Strict_32Bit WAITRDC:5;             /**< \brief [11:7] Programmed Wait States for read accesses (rw) */
    Ifx_Strict_32Bit DATAC:4;               /**< \brief [15:12] Data Hold Cycles for Read Accesses (rw) */
    Ifx_Strict_32Bit EXTCLOCK:2;            /**< \brief [17:16] Frequency of external clock at pin BFCLKO or SDCLKO (rw) */
    Ifx_Strict_32Bit EXTDATA:2;             /**< \brief [19:18] Extended data (rw) */
    Ifx_Strict_32Bit CMDDELAY:4;            /**< \brief [23:20] Command Delay Cycles (rw) */
    Ifx_Strict_32Bit AHOLDC:4;              /**< \brief [27:24] Address Hold Cycles (rw) */
    Ifx_Strict_32Bit ADDRC:4;               /**< \brief [31:28] Address Cycles (rw) */
} Ifx_EBU_BUSRAP_Bits;

/** \\brief  EBU Bus Configuration Register */
typedef struct _Ifx_EBU_BUSRCON_Bits
{
    Ifx_Strict_32Bit FETBLEN:3;             /**< \brief [2:0] Burst Length for Synchronous Burst (rw) */
    Ifx_Strict_32Bit FBBMSEL:1;             /**< \brief [3:3] Synchronous burst buffer mode select (rw) */
    Ifx_Strict_32Bit RESERVED:1;            /**< \brief [4:4] Reserved (r) */
    Ifx_Strict_32Bit FDBKEN:1;              /**< \brief [5:5] Burst FLASH Clock Feedback Enable (rw) */
    Ifx_Strict_32Bit BFCMSEL:1;             /**< \brief [6:6] Burst Flash Clock Mode Select (rw) */
    Ifx_Strict_32Bit NAA:1;                 /**< \brief [7:7] Enable flash non-array access workaround (rw) */
    Ifx_Strict_32Bit RES1:8;                /**< \brief [15:8] Reserved (r) */
    Ifx_Strict_32Bit ECSE:1;                /**< \brief [16:16] Early Chip Select for Synchronous Burst (rw) */
    Ifx_Strict_32Bit EBSE:1;                /**< \brief [17:17] Early Burst Signal Enable for Synchronous Burst (rw) */
    Ifx_Strict_32Bit DBA:1;                 /**< \brief [18:18] Disable Burst Address Wrapping (rw) */
    Ifx_Strict_32Bit WAITINV:1;             /**< \brief [19:19] Reversed polarity at WAIT (rw) */
    Ifx_Strict_32Bit BCGEN:2;               /**< \brief [21:20] Byte Control Signal Control (rw) */
    Ifx_Strict_32Bit PORTW:2;               /**< \brief [23:22] Device Addressing Mode (rw) */
    Ifx_Strict_32Bit WAIT:2;                /**< \brief [25:24] External Wait Control (rw) */
    Ifx_Strict_32Bit AAP:1;                 /**< \brief [26:26] Asynchronous Address phase: (rw) */
    Ifx_Strict_32Bit LCKABRT:1;             /**< \brief [27:27] Lock Abort (rwh) */
    Ifx_Strict_32Bit AGEN:4;                /**< \brief [31:28] Device Type for Region (rw) */
} Ifx_EBU_BUSRCON_Bits;

/** \\brief  EBU Bus Write Access Parameter Register */
typedef struct _Ifx_EBU_BUSWAP_Bits
{
    Ifx_Strict_32Bit WRDTACS:4;             /**< \brief [3:0] Recovery Cycles between Different Regions (rw) */
    Ifx_Strict_32Bit WRRECOVC:3;            /**< \brief [6:4] Recovery Cycles after Write Accesses (rw) */
    Ifx_Strict_32Bit WAITWRC:5;             /**< \brief [11:7] Programmed Wait States for write accesses (rw) */
    Ifx_Strict_32Bit DATAC:4;               /**< \brief [15:12] Data Hold Cycles for Write Accesses (rw) */
    Ifx_Strict_32Bit EXTCLOCK:2;            /**< \brief [17:16] Frequency of external clock at pin BFCLKO or SDCLKO (rw) */
    Ifx_Strict_32Bit EXTDATA:2;             /**< \brief [19:18] Extended data (rw) */
    Ifx_Strict_32Bit CMDDELAY:4;            /**< \brief [23:20] Command Delay Cycles (rw) */
    Ifx_Strict_32Bit AHOLDC:4;              /**< \brief [27:24] Address Hold Cycles (rw) */
    Ifx_Strict_32Bit ADDRC:4;               /**< \brief [31:28] Address Cycles (rw) */
} Ifx_EBU_BUSWAP_Bits;

