HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEbu_regdef.h
/** \\brief  EBU Bus Write Configuration Register */
typedef struct _Ifx_EBU_BUSWCON_Bits
{
    Ifx_Strict_32Bit FETBLEN:3;             /**< \brief [2:0] Burst Length for Synchronous Burst (rw) */
    Ifx_Strict_32Bit FBBMSEL:1;             /**< \brief [3:3] Synchronous burst buffer mode select (rw) */
    Ifx_Strict_32Bit RES:3;                 /**< \brief [6:4] Reserved, always reads 0 (r) */
    Ifx_Strict_32Bit NAA:1;                 /**< \brief [7:7] Enable flash non-array access workaround (r) */
    Ifx_Strict_32Bit RES0:8;                /**< \brief [15:8] Reserved (r) */
    Ifx_Strict_32Bit ECSE:1;                /**< \brief [16:16] Early Chip Select for Synchronous Burst (rw) */
    Ifx_Strict_32Bit EBSE:1;                /**< \brief [17:17] Early Burst Signal Enable for Synchronous Burst (rw) */
    Ifx_Strict_32Bit RES1:1;                /**< \brief [18:18] Reserved, always reads 0 (r) */
    Ifx_Strict_32Bit WAITINV:1;             /**< \brief [19:19] Reversed polarity at WAIT (rw) */
    Ifx_Strict_32Bit BCGEN:2;               /**< \brief [21:20] Byte Control Signal Control (rw) */
    Ifx_Strict_32Bit PORTW:2;               /**< \brief [23:22] Device Addressing Mode (r) */
    Ifx_Strict_32Bit WAIT:2;                /**< \brief [25:24] External Wait Control (rw) */
    Ifx_Strict_32Bit AAP:1;                 /**< \brief [26:26] Asynchronous Address phase: (rw) */
    Ifx_Strict_32Bit LOCKCS:1;              /**< \brief [27:27] Lock Chip Select (rw) */
    Ifx_Strict_32Bit AGEN:4;                /**< \brief [31:28] Device Type for Region (rw) */
} Ifx_EBU_BUSWCON_Bits;

/** \\brief  EBU Clock Control Register */
typedef struct _Ifx_EBU_CLC_Bits
{
    Ifx_Strict_32Bit DISR:1;                /**< \brief [0:0] EBU Disable Request Bit (rw) */
    Ifx_Strict_32Bit DISS:1;                /**< \brief [1:1] EBU Disable Status Bit (r) */
    Ifx_Strict_32Bit reserved_2:6;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EPE:1;                 /**< \brief [8:8] Endinit Protection Enable (rw) */
    Ifx_Strict_32Bit reserved_9:7;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SYNC:1;                /**< \brief [16:16] EBU Clocking Mode (rw) */
    Ifx_Strict_32Bit DIV2:1;                /**< \brief [17:17] DIV2 Clocking Mode (rw) */
    Ifx_Strict_32Bit EBUDIV:2;              /**< \brief [19:18] EBU Clock Divide Ratio (rw) */
    Ifx_Strict_32Bit SYNCACK:1;             /**< \brief [20:20] EBU Clocking Mode Status (r) */
    Ifx_Strict_32Bit DIV2ACK:1;             /**< \brief [21:21] DIV2 Clocking Mode Status (r) */
    Ifx_Strict_32Bit EBUDIVACK:2;           /**< \brief [23:22] EBU Clock Divide Ratio Status (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_EBU_CLC_Bits;

/** \\brief  EBU External Boot Configuration Register */
typedef struct _Ifx_EBU_EXTBOOT_Bits
{
    Ifx_Strict_32Bit CFGEND:1;              /**< \brief [0:0] Configuration End (rh) */
    Ifx_Strict_32Bit CFGERR:1;              /**< \brief [1:1] Configuration Fetch Error (rh) */
    Ifx_Strict_32Bit reserved_2:29;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EBUCFG:1;              /**< \brief [31:31] Configuration Word Fetch (w) */
} Ifx_EBU_EXTBOOT_Bits;

/** \\brief  EBU Module Identification Register */
typedef struct _Ifx_EBU_ID_Bits
{
    Ifx_Strict_32Bit ID_VALUE:32;           /**< \brief [31:0] Module Identification Value (r) */
} Ifx_EBU_ID_Bits;

/** \\brief  EBU Configuration Register */
typedef struct _Ifx_EBU_MODCON_Bits
{
    Ifx_Strict_32Bit STS:1;                 /**< \brief [0:0] Memory Status Bit (r) */
    Ifx_Strict_32Bit LCKABRT:1;             /**< \brief [1:1] Lock Abort (rwh) */
    Ifx_Strict_32Bit SDTRI:1;               /**< \brief [2:2] SDRAM Tristate (rw) */
    Ifx_Strict_32Bit CLK_COMB:1;            /**< \brief [3:3] Combined External Bus Clock (rw) */
    Ifx_Strict_32Bit EXTLOCK:1;             /**< \brief [4:4] External Bus Lock Control (rw) */
    Ifx_Strict_32Bit ARBSYNC:1;             /**< \brief [5:5] Arbitration Signal Synchronization Control (rw) */
    Ifx_Strict_32Bit ARBMODE:2;             /**< \brief [7:6] Arbitration Mode Selection (rw) */
    Ifx_Strict_32Bit TIMEOUTC:8;            /**< \brief [15:8] Bus Time-out Control (rw) */
    Ifx_Strict_32Bit LOCKTIMEOUT:8;         /**< \brief [23:16] Lock Timeout Counter Preload (rw) */
    Ifx_Strict_32Bit FIFO_BYPASS:1;         /**< \brief [24:24] Reserved (rw) */
    Ifx_Strict_32Bit FAST_SRI:1;            /**< \brief [25:25] Clock Cycles used for SRI Address Decode (rw) */
    Ifx_Strict_32Bit OCDS_SUSP_DIS:1;       /**< \brief [26:26] OCDS SUSPEND Disable (rw) */
    Ifx_Strict_32Bit reserved_27:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BUSSTATE:1;            /**< \brief [30:30] External Bus State (rh) */
    Ifx_Strict_32Bit ALE:1;                 /**< \brief [31:31] ALE Mode (rw) */
} Ifx_EBU_MODCON_Bits;

/** \\brief  EBU SDRAM Control Register */
typedef struct _Ifx_EBU_SDR_CON_Bits
{
    Ifx_Strict_32Bit CRAS:4;                /**< \brief [3:0] Row to precharge delay counter (rw) */
    Ifx_Strict_32Bit CRFSH:4;               /**< \brief [7:4] Initialization refresh commands counter (rw) */
    Ifx_Strict_32Bit CRSC:2;                /**< \brief [9:8] Mode register set-up time (rw) */
    Ifx_Strict_32Bit CRP:2;                 /**< \brief [11:10] Row precharge time counter (rw) */
    Ifx_Strict_32Bit AWIDTH:2;              /**< \brief [13:12] Width of column address (rw) */
    Ifx_Strict_32Bit CRCD:2;                /**< \brief [15:14] Row to column delay counter (rw) */
    Ifx_Strict_32Bit CRC:6;                 /**< \brief [21:16] Refresh cycle time counter (rw) */
    Ifx_Strict_32Bit BANKM:3;               /**< \brief [24:22] Mask for bank tag (rw) */
    Ifx_Strict_32Bit reserved_25:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CLKDIS:1;              /**< \brief [28:28] Disable SDRAM clock output (rw) */
    Ifx_Strict_32Bit PWR_MODE:2;            /**< \brief [30:29] Power Save Mode used for gated clock mode (rw) */
    Ifx_Strict_32Bit SDCMSEL:1;             /**< \brief [31:31] SDRAM clock mode select (rw) */
} Ifx_EBU_SDR_CON_Bits;

/** \\brief  EBU SDRAM Mode Register */
typedef struct _Ifx_EBU_SDR_MOD_Bits
{
    Ifx_Strict_32Bit BURSTL:3;              /**< \brief [2:0] Burst length (rw) */
    Ifx_Strict_32Bit BTYP:1;                /**< \brief [3:3] Burst type (rw) */
    Ifx_Strict_32Bit CASLAT:3;              /**< \brief [6:4] CAS latency (rw) */
    Ifx_Strict_32Bit OPMODE:7;              /**< \brief [13:7] Operation Mode (rw) */
    Ifx_Strict_32Bit reserved_14:1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit COLDSTART:1;           /**< \brief [15:15] SDRAM coldstart (w) */
    Ifx_Strict_32Bit XOPM:14;               /**< \brief [29:16] Extended Operation Mode (rw) */
    Ifx_Strict_32Bit XBA:2;                 /**< \brief [31:30] Extended Operation Bank Select (rw) */
} Ifx_EBU_SDR_MOD_Bits;

/** \\brief  EBU SDRAM Refresh Control Register */
typedef struct _Ifx_EBU_SDR_REF_Bits
{
    Ifx_Strict_32Bit REFRESHC:6;            /**< \brief [5:0] Refresh counter period (rw) */
    Ifx_Strict_32Bit REFRESHR:3;            /**< \brief [8:6] Number of refresh commands (rw) */
    Ifx_Strict_32Bit SELFREXST:1;           /**< \brief [9:9] Self Refresh Exit Status. (rh) */
    Ifx_Strict_32Bit SELFREX:1;             /**< \brief [10:10] Self Refresh Exit (Power Up). (rw) */
    Ifx_Strict_32Bit SELFRENST:1;           /**< \brief [11:11] Self Refresh Entry Status. (rh) */
    Ifx_Strict_32Bit SELFREN:1;             /**< \brief [12:12] Self Refresh Entry (rw) */
    Ifx_Strict_32Bit AUTOSELFR:1;           /**< \brief [13:13] Automatic Self Refresh (rw) */
    Ifx_Strict_32Bit ERFSHC:2;              /**< \brief [15:14] Extended Refresh Counter Period (rw) */
    Ifx_Strict_32Bit SELFREX_DLY:8;         /**< \brief [23:16] Self Refresh Exit Delay (rw) */
    Ifx_Strict_32Bit ARFSH:1;               /**< \brief [24:24] Auto Refresh on Self refresh Exit (rw) */
    Ifx_Strict_32Bit RES_DLY:3;             /**< \brief [27:25] Delay on Power Down Exit (rw) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_EBU_SDR_REF_Bits;

/** \\brief  EBU SDRAM Status Register */
typedef struct _Ifx_EBU_SDR_STAT_Bits
{
    Ifx_Strict_32Bit REFERR:1;              /**< \brief [0:0] SDRAM Refresh Error (rwh) */
    Ifx_Strict_32Bit SDRMBUSY:1;            /**< \brief [1:1] SDRAM Busy (rh) */
    Ifx_Strict_32Bit SDERR:1;               /**< \brief [2:2] SDRAM read error (rwh) */
    Ifx_Strict_32Bit reserved_3:29;         /**< \brief \internal Reserved */
} Ifx_EBU_SDR_STAT_Bits;

/** \\brief  EBU Test/Control Configuration Register */
typedef struct _Ifx_EBU_USERCON_Bits
{
    Ifx_Strict_32Bit DIP:1;                 /**< \brief [0:0] Disable Internal Pipelining (rw) */
    Ifx_Strict_32Bit NAF:7;                 /**< \brief [7:1] No Assigned Function (rw) */
    Ifx_Strict_32Bit RES1:8;                /**< \brief [15:8] Reserved (r) */
    Ifx_Strict_32Bit ADDIO:4;               /**< \brief [19:16] Address Pins to GPIO Mode (rw) */
    Ifx_Strict_32Bit reserved_20:8;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RES:2;                 /**< \brief [29:28] Byte Control Enable (r) */
    Ifx_Strict_32Bit ADVIO:1;               /**< \brief [30:30] ADV Pin to GPIO Mode (rw) */
    Ifx_Strict_32Bit ADDLSW:1;              /**< \brief [31:31] Enable Address LSW, A(15:0) for GPIO (rw) */
} Ifx_EBU_USERCON_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ebu_union
 * \{  */

/** \\brief  EBU Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_ACCEN0_Bits B;
} Ifx_EBU_ACCEN0;

