HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEbu_regdef.h
/** \\brief  EBU Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_ACCEN1_Bits B;
} Ifx_EBU_ACCEN1;

/** \\brief  EBU Address Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_ADDRSEL_Bits B;
} Ifx_EBU_ADDRSEL;

/** \\brief  EBU Bus Read Access Parameter Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_BUSRAP_Bits B;
} Ifx_EBU_BUSRAP;

/** \\brief  EBU Bus Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_BUSRCON_Bits B;
} Ifx_EBU_BUSRCON;

/** \\brief  EBU Bus Write Access Parameter Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_BUSWAP_Bits B;
} Ifx_EBU_BUSWAP;

/** \\brief  EBU Bus Write Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_BUSWCON_Bits B;
} Ifx_EBU_BUSWCON;

/** \\brief  EBU Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_CLC_Bits B;
} Ifx_EBU_CLC;

/** \\brief  EBU External Boot Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_EXTBOOT_Bits B;
} Ifx_EBU_EXTBOOT;

/** \\brief  EBU Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_ID_Bits B;
} Ifx_EBU_ID;

/** \\brief  EBU Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_MODCON_Bits B;
} Ifx_EBU_MODCON;

/** \\brief  EBU SDRAM Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_SDR_CON_Bits B;
} Ifx_EBU_SDR_CON;

/** \\brief  EBU SDRAM Mode Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_SDR_MOD_Bits B;
} Ifx_EBU_SDR_MOD;

/** \\brief  EBU SDRAM Refresh Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_SDR_REF_Bits B;
} Ifx_EBU_SDR_REF;

/** \\brief  EBU SDRAM Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_SDR_STAT_Bits B;
} Ifx_EBU_SDR_STAT;

/** \\brief  EBU Test/Control Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_EBU_USERCON_Bits B;
} Ifx_EBU_USERCON;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ebu_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  Bus object */
typedef volatile struct _Ifx_EBU_BUS
{
    Ifx_EBU_BUSRCON RCON;                   /**< \brief 0, EBU Bus Configuration Register */
    Ifx_EBU_BUSRAP RAP;                     /**< \brief 4, EBU Bus Read Access Parameter Register */
    Ifx_EBU_BUSWCON WCON;                   /**< \brief 8, EBU Bus Write Configuration Register */
    Ifx_EBU_BUSWAP WAP;                     /**< \brief C, EBU Bus Write Access Parameter Register */
} Ifx_EBU_BUS;

/** \\brief  SDRAM object */
typedef volatile struct _Ifx_EBU_SDR
{
    Ifx_EBU_SDR_CON CON;                    /**< \brief 0, EBU SDRAM Control Register */
    Ifx_EBU_SDR_MOD MOD;                    /**< \brief 4, EBU SDRAM Mode Register */
    Ifx_EBU_SDR_REF REF;                    /**< \brief 8, EBU SDRAM Refresh Control Register */
    Ifx_EBU_SDR_STAT STAT;                  /**< \brief C, EBU SDRAM Status Register */
} Ifx_EBU_SDR;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ebu_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  EBU object */
typedef volatile struct _Ifx_EBU
{
    Ifx_EBU_CLC CLC;                        /**< \brief 0, EBU Clock Control Register */
    Ifx_EBU_MODCON MODCON;                  /**< \brief 4, EBU Configuration Register */
    Ifx_EBU_ID ID;                          /**< \brief 8, EBU Module Identification Register */
    Ifx_EBU_USERCON USERCON;                /**< \brief C, EBU Test/Control Configuration Register */
    Ifx_EBU_EXTBOOT EXTBOOT;                /**< \brief 10, EBU External Boot Configuration Register */
    unsigned char reserved_14[4];           /**< \brief 14, \internal Reserved */
    Ifx_EBU_ADDRSEL ADDRSEL[3];             /**< \brief 18, EBU Address Select Register */
    unsigned char reserved_24[4];           /**< \brief 24, \internal Reserved */
    Ifx_EBU_BUS BUS[3];                     /**< \brief 28, Bus objects */
    unsigned char reserved_58[16];          /**< \brief 58, \internal Reserved */
    Ifx_EBU_SDR SDR;                        /**< \brief 68, SDRAM object */
    unsigned char reserved_78[56];          /**< \brief 78, \internal Reserved */
    Ifx_EBU_ACCEN0 ACCEN0;                  /**< \brief B0, EBU Access Enable Register 0 */
    Ifx_EBU_ACCEN1 ACCEN1;                  /**< \brief B4, EBU Access Enable Register 1 */
    unsigned char reserved_B8[840];         /**< \brief B8, \internal Reserved */
} Ifx_EBU;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEBU_REGDEF_H */
